max-bot-cf/InformationRegisters/энргЗначенияЛьготныхКатегорий.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>энргЗначенияЛьготныхКатегорий</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ПроцентОтНачислений</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>5</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Район</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЗоныОтвественности</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ЛьготнаяКатегория</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.энргЛьготныеКатегории</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

max-bot-cf/InformationRegisters/энргЗначенияЛьготныхКатегорий/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограмныйИнтерфейс

Функция ПолучитьЗначенияЛьготнойКатегории(Категория, Организация, Район, Период) Экспорт 
	
	 Данные 	= Новый Структура;
	 
	 Запрос  					= Новый Запрос(ТекстЗапросаЗначенийЛьготныхКатегорий());
	 Запрос.УстановитьПараметр("Категория", Категория);
	 Запрос.УстановитьПараметр("Организация", Организация);
	 Запрос.УстановитьПараметр("Район", Район);
	 Запрос.УстановитьПараметр("Период", Период);
	 Результат 					= Запрос.Выполнить();
	 Для Каждого КолонкаРезультата Из Результат.Колонки Цикл
		Данные.Вставить(КолонкаРезультата.Имя, КолонкаРезультата.ТипЗначения.ПривестиЗначение());
	 КонецЦикла;
	
	 Если Не Результат.Пустой() Тогда
		Выборка 				= Результат.Выбрать(); 
		Выборка.Следующий();
		ЗаполнитьЗначенияСвойств(Данные,Выборка);
	 КонецЕсли;
	 
	 Возврат Данные;	 
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция ТекстЗапросаЗначенийЛьготныхКатегорий()
	
	Текст  = 
	"ВЫБРАТЬ
	|	энргЗначенияЛьготныхКатегорийСрезПоследних.Период КАК Период,
	|	энргЗначенияЛьготныхКатегорийСрезПоследних.Организация КАК Организация,
	|	энргЗначенияЛьготныхКатегорийСрезПоследних.Район КАК Район,
	|	энргЗначенияЛьготныхКатегорийСрезПоследних.ЛьготнаяКатегория КАК ЛьготнаяКатегория,
	|	энргЗначенияЛьготныхКатегорийСрезПоследних.ПроцентОтНачислений КАК ПроцентОтНачислений,
	|	энргЗначенияЛьготныхКатегорийСрезПоследних.Сумма КАК Сумма
	|ИЗ
	|	РегистрСведений.энргЗначенияЛьготныхКатегорий.СрезПоследних(
	|			&Период,
	|			ЛьготнаяКатегория = &Категория
	|				И Организация = &Организация
	|				И Район = &Район) КАК энргЗначенияЛьготныхКатегорийСрезПоследних";
	
	Возврат Текст;
	
КонецФункции

#КонецОбласти

#КонецЕсли
